project05/app/views/authors/index.html.erb


<%= pluralize(@authors.count, "author") + "." %>
---
SELECT "authors".* FROM "authors"