project05/app/views/authors/index.html.haml

SELECT "authors".* FROM "authors"
---
%br/
= pluralize(@authors.count, "author") + "."