project05/app/views/authors/show.html.haml

%ul
  - @author.articles.each do |article|
---
SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = 5