project05/app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(:page => params[:page], :per_page => 10)    #Article.all
---
SELECT "articles".* FROM "articles" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def edit
    @article = Article.find(params[:id])
    @article.increment!(:edits)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "edits" = 1, "updated_at" = '2012-02-08 16:52:14.368993' WHERE "articles"."id" = 43

  def create
    @article = Article.new(params[:article])

    @article.creation = Date.today
    @article.edits = 0

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("author", "body", "created_at", "creation", "edits", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "29"]]
UPDATE "articles" SET "body" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam lacinia ipsum at justo sagittis id adipiscing nisi congue. Nunc vel dui neque. Aliquam egestas nunc at lectus elementum dapibus. Fusce quis tellus felis. Aliquam erat volutpat. Vivamus lacinia suscipit dui ut sollicitudin. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos. Nam sed sapien sem. Phasellus fringilla, dui vel consequat mattis, augue nibh bibendum libero, in venenatis sapien turpis at mi. Nulla facilisi. Mauris iaculis bibendum vulputate. Duis sagittis justo sed lacus feugiat consequat. Sed id laoreet erat. Morbi id aliquet erat.jfdksjflksadjfklsdjflkasdjfksdlalllllllllllllllllllllllllllll