project05/app/views/articles/index.html.erb


<%= pluralize(@articles.count, "article") + "." %>
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"