project05/app/views/articles/index.html.haml

SELECT "articles".* FROM "articles" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
%br/
= pluralize(@articles.count, "article") + "."
.paginatewrapper= will_paginate @articles